In [3]:
import pandas as pd
import numpy as np

Шаг 5

In [15]:
# https://stepik.org/media/attachments/course/4852/dota_hero_stats.csv
hero_stats = pd.read_csv("dota_hero_stats.csv", index_col=0)
# first column will be with name "Unname: 0", not to be so, specify index_col=0, default if False

In [16]:
hero_stats.groupby("legs").aggregate({"legs": "count"})
#hero_stats.groupby('legs').size()
#hero_stats.groupby('legs').count()
#hero_stats.legs.unique()
#hero_stats.legs.value_counts()
#hero_stats["legs"].value_counts()
#hero_stats.aggregate({'legs': 'value_counts'}).sort_index()
#hero_stats.groupby(['legs']).id.nunique()
#hero_stats.loc[hero_stats.legs == 2].shape
#[len(hero_stats[hero_stats.legs == i]) for i in [0,2,4,6,8]]

      legs
legs
0       11
2       95
4        7
6        3
8        1

Шаг 6: Лупа и Пуппа

In [4]:
#https://stepik.org/media/attachments/course/4852/accountancy.csv
df = pd.read_csv("accountancy.csv", index_col=0)
#df.head()
#df.groupby(["Executor", "Type"]).aggregate({"Salary": "mean"})
#df.groupby(["Executor", "Type"]).mean()
#df.pivot_table(index='Executor',values='Salary',columns='Type',aggfunc='mean').T
df.pivot_table(values = "Salary", index = "Executor", columns = "Type")

Type               A           B           C           D      E       F
Executor
Loopa      58.000000  145.166667  154.333333  137.714286  164.0  238.00
Pupa      160.833333   77.000000   74.500000  146.500000  131.2  136.25

In [7]:
df = pd.read_csv("accountancy.csv")
df.drop('Unnamed: 0', axis=1) \
    .groupby(['Type', 'Executor'], as_index=False) \
    .mean() \
    .sort_values(['Type', 'Salary'], ascending=[True, False]) \
    .groupby('Type') \
    .head(1)

   Type Executor      Salary
1     A     Pupa  160.833333
2     B    Loopa  145.166667
4     C    Loopa  154.333333
7     D     Pupa  146.500000
8     E    Loopa  164.000000
10    F    Loopa  238.000000

In [9]:
(df[df['Executor']=='Pupa'].groupby(['Type']).mean())>(df[df['Executor']=='Loopa'].groupby(['Type']).mean())

      Unnamed: 0  Salary
Type
A          False    True
B           True   False
C          False   False
D          False    True
E          False   False
F           True   False

In [11]:
df.pivot_table(['Salary'], ['Type'], ['Executor'], aggfunc=('mean'))

              Salary
Executor       Loopa        Pupa
Type
A          58.000000  160.833333
B         145.166667   77.000000
C         154.333333   74.500000
D         137.714286  146.500000
E         164.000000  131.200000
F         238.000000  136.250000

Шаг 7

In [51]:
hero_stats.groupby('attack_type').aggregate({'attack_type':"count"})

             attack_type
attack_type
Melee                 56
Ranged                61

In [52]:
hero_stats.groupby('primary_attr').aggregate({'primary_attr':"count"})

              primary_attr
primary_attr
agi                     37
int                     42
str                     38

In [63]:
#hero_stats.groupby(['attack_type', 'primary_attr']).agg({'id': 'count'}).sort_values('id', ascending=False)
#hero_stats.groupby(['attack_type','primary_attr']).size()
hero_stats.groupby(['attack_type','primary_attr']).count()

                          id  legs  localized_name  name  roles
attack_type primary_attr
Melee       agi           19    19              19    19     19
            int            2     2               2     2      2
            str           35    35              35    35     35
Ranged      agi           18    18              18    18     18
            int           40    40              40    40     40
            str            3     3               3     3      3

In [64]:
hero_stats.groupby(['attack_type', 'primary_attr']).id.nunique()

attack_type  primary_attr
Melee        agi             19
             int              2
             str             35
Ranged       agi             18
             int             40
             str              3
Name: id, dtype: int64

Шаг 8

In [66]:
# http://stepik.org/media/attachments/course/4852/algae.csv
df = pd.read_csv('algae.csv')

In [69]:
df.head()

,species,genus,group,sucrose,alanin,citrate,glucose,oleic_acid
0,Fucus_vesiculosus,Fucus,brown,3.001472,3.711498,5.004262,2.548459,6.405165
1,Saccharina_japonica,Saccharina,brown,6.731070,1.255251,5.621499,6.013219,4.156700
2,Fucus_serratus,Fucus,brown,3.276870,0.346431,1.216767,3.623225,0.304573
3,Fucus_distichus,Fucus,brown,6.786996,6.641303,6.423606,2.272724,3.393203
4,Cladophora_fracta,Cladophora,green,3.861470,1.648450,6.940588,2.316955,2.528886

In [73]:
df.groupby('genus').mean()

              sucrose    alanin   citrate   glucose  oleic_acid
genus
Ascophyllum  6.825467  0.875429  5.253527  3.414961    2.432526
Cladophora   4.008792  3.997055  5.288311  2.800276    2.263472
Fucus        4.355112  3.566411  4.214878  2.814803    3.367647
Palmaria     0.704580  3.176440  5.573905  3.242090    2.245538
Saccharina   4.183596  3.524207  3.346710  4.980594    4.487252

Шаг 9

In [98]:
fucus = df[df['genus'] == 'Fucus']
fucus.alanin.min()
fucus.alanin.mean()
fucus.alanin.max()

6.641303172624768

In [108]:
fucus.agg(['min','mean','max']).alanin.round(2)

min     0.35
max     6.64
mean    3.57
Name: alanin, dtype: float64

Шаг 10

In [112]:
g = df.groupby('group')

In [123]:
g.citrate.agg('var').round(2)

group
brown    5.47
green    3.95
red       NaN
Name: citrate, dtype: float64

In [146]:
t = g.sucrose.agg(['min','max']).round(2)
t['razmah'] = t['max'] - t['min']
#t['max']
t

        min   max  razmah
group
brown  1.64  6.83    5.19
green  2.45  5.71    3.26
red    0.70  0.70    0.00

In [139]:
g.species.nunique()

group
brown    6
green    3
red      1
Name: species, dtype: int64

In [143]:
df.groupby('group').aggregate({"species":'nunique', 'citrate':'var','sucrose': np.ptp}).round(2)

c:\python36\lib\site-packages\numpy\core\fromnumeric.py:2223: FutureWarning: Method .ptp is deprecated and will be removed in a future version. Use numpy.ptp instead.
  return ptp(axis=axis, out=out, **kwargs)

       species  citrate  sucrose
group
brown        6     5.47     5.19
green        3     3.95     3.26
red          1      NaN     0.00

In [144]:
df.groupby('group') \
    .agg({'citrate': 'var', 'sucrose': lambda x: x.max() - x.min(), 'glucose': 'count'}) \
    .round(2)

       citrate  sucrose  glucose
group
brown     5.47     5.19        6
green     3.95     3.26        3
red        NaN     0.00        1